Lex-Wills/Robot-Control-/ROBO5003 CW final submission_19044341/ROBO5003 CW week 10/rx150-handout/rx150/clients/animation-demo.cpp

#include <cstdlib>
#include <cstring>
#include <iostream>
#include <boost/asio.hpp>
#include <boost/array.hpp>
#include <tcp/RX150RemoteInterface.h>

#include "tcp/RobotServerComm.h"

using namespace std;
using namespace Eigen;

int main(int argc, char* argv[]){

    string remoteHost = "localhost";
    if(argc==2){
        remoteHost = argv[1];
    }

    shared_ptr<RX150RobotInterface> robot = RX150RemoteInterface::create(remoteHost);

    uint t = 0;
    while(true){
        VectorXd joints = VectorXd::Zero(5);
        joints << 0, 0, 0, 0, 0;
        const int length = 200;
        joints[(t/length)%5] += 3.14/4.0 * sin((t/(double)length) * 2 * M_PI);
        t++;

        robot->setTargetJointAngles(joints);
        cout << "Target:  " << joints.transpose() << endl;
        cout << "Current: " << robot->getCurrentJointAngles().transpose() << endl;
        cerr << joints.transpose() << "\t" << robot->getCurrentJointAngles().transpose() << endl;
        cout << endl;

        usleep(25*1000);
    }

    return 0;
}
